#+TITLE: Comparing DoC, MRDoC and MRDoC2 
#+SUBTITLE: Dealing with final review comments - reverting back before Mike's suggestion of increasing rA 
#+AUTHOR:lf_araujo
#+DATE: 2024-07-30 ter
#+PROPERTY: toc:2
#+OPTIONS: broken-links :t
#+ATTR_HTML: :width 300
#+SETUPFILE: "./src/style/style.theme"
#+PROPERTY: header-args R :dir "/ssh:group.vipbg.vcu.edu|qsub:ldearaujo@group.vipbg.vcu.edu:/home/ldearaujo/2022-mrdoc2" :session R-pw :exports both :eval yes


* System information

#+begin_src R :results output :session R-pw :exports both
sessionInfo()
#+end_src

#+results:
#+begin_example
r version 4.2.2 (2022-10-31)
platform: x86_64-solus-linux-gnu (64-bit)
running under: solus 4.4 harmony

matrix products: default
blas:   /usr/lib64/haswell/libopenblas_haswellp-r0.3.20.so
lapack: /usr/lib64/r/lib/librlapack.so

locale:
 [1] lc_ctype=en_us.utf-8       lc_numeric=c
 [3] lc_time=pt_br.utf-8        lc_collate=en_us.utf-8
 [5] lc_monetary=pt_br.utf-8    lc_messages=en_us.utf-8
 [7] lc_paper=pt_br.utf-8       lc_name=c
 [9] lc_address=c               lc_telephone=c
[11] lc_measurement=pt_br.utf-8 lc_identification=c

attached base packages:
[1] parallel  stats     graphics  grdevices utils     datasets  methods
[8] base

other attached packages:
 [1] dtplyr_1.2.2           patchwork_1.1.2        ggrepel_0.9.2
 [4] RColorBrewer_1.1-3     scales_1.2.1           doParallel_1.0.17
 [7] iterators_1.0.14       foreach_1.5.2          akima_0.6-3.4
[10] rgl_0.111.6            ggpubr_0.5.0           forcats_1.0.0
[13] stringr_1.5.0          dplyr_1.1.2            purrr_1.0.1
[16] readr_2.1.3            tidyr_1.3.0            tidyverse_1.3.2
[19] knitr_1.41             lattice_0.20-45        plotly_4.10.1
[22] ggplot2_3.4.0          MASS_7.3-58.1          umx_4.21.0
[25] OpenMx_2.19.6-6        ProjectTemplate_0.10.2 tibble_3.2.1
[28] digest_0.6.31

loaded via a namespace (and not attached):
 [1] nlme_3.1-160        fs_1.6.2            lubridate_1.9.0
 [4] webshot_0.5.4       httr_1.4.4          rprojroot_2.0.3
 [7] DiagrammeRsvg_0.1   tools_4.2.2         backports_1.4.1
[10] utf8_1.2.2          R6_2.5.1            DBI_1.1.3
[13] lazyeval_0.2.2      colorspace_2.0-3    sp_1.5-1
[16] withr_2.5.0         tidyselect_1.2.0    curl_5.0.0
[19] compiler_4.2.2      polycor_0.8-1       cli_3.6.0
[22] rvest_1.0.3         xml2_1.3.3          labeling_0.4.2
[25] systemfonts_1.0.4   rmarkdown_2.19      svglite_2.1.1
[28] base64enc_0.1-3     pkgconfig_2.0.3     htmltools_0.5.4
[31] MuMIn_1.47.1        dbplyr_2.2.1        fastmap_1.1.0
[34] htmlwidgets_1.6.1   rlang_1.1.0         readxl_1.4.1
[37] rstudioapi_0.14     farver_2.1.1        visNetwork_2.1.2
[40] generics_0.1.3      jsonlite_1.8.4      car_3.1-1
[43] googlesheets4_1.0.1 magrittr_2.0.3      kableExtra_1.3.4
[46] Matrix_1.5-1        Rcpp_1.0.9          munsell_0.5.0
[49] fansi_1.0.3         abind_1.4-5         lifecycle_1.0.3
[52] stringi_1.7.12      carData_3.0-5       grid_4.2.2
[55] crayon_1.5.2        haven_2.5.1         cowplot_1.1.1
[58] hms_1.1.2           pillar_1.9.0        ggsignif_0.6.4
[61] codetools_0.2-18    admisc_0.30         stats4_4.2.2
[64] reprex_2.0.2        glue_1.6.2          evaluate_0.19
[67] V8_4.2.2            data.table_1.14.6   RcppParallel_5.1.6
[70] modelr_0.1.10       vctrs_0.6.1         tzdb_0.3.0
[73] cellranger_1.1.0    gtable_0.3.1        assertthat_0.2.1
[76] xfun_0.39           xtable_1.8-4        broom_1.0.2
[79] rsvg_2.4.0          rstatix_0.7.1       googledrive_2.0.0
[82] viridisLite_0.4.1   gargle_1.2.1        timechange_0.2.0
[85] DiagrammeR_1.0.9    ellipsis_0.3.2      here_1.0.1
#+end_example
